Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider
The Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider class provides creation commands specific for the expected user input.

Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider.OnePointParameter
The input by one point.

Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider.TwoPointsParameter
The input by two points.

Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider.ThreePointsParameter
The input by three points.

Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider.ManyPointsParameter
The input by many points.

Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider.FaceParameter
The input by face.

Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider.LinesParameter
The input by lines.

Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider.InputTypes
The supported input types.

Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider.type
The System.Type value describing the target type.

Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider.typeString
The System.String value identifying the target object type.

Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider.#ctor(System.Type)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider class.
targetType: The System.Type value describing the target type of the creation commands.

Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider.#ctor(System.Type,System.String)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider class.
targetType: The System.Type value describing the target type of the creation commands.
targetTypeAsString: The System.String value to identifying the target object type of the creation commands.

Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider.ByOnePoint
Gets the Tekla.BIM.DirectManipulation.Features.CreationCommandParameter for creating the object by one point.

Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider.ByTwoPoints
Gets the Tekla.BIM.DirectManipulation.Features.CreationCommandParameter for creating the object by two points.

Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider.ByThreePoints
Gets the Tekla.BIM.DirectManipulation.Features.CreationCommandParameter for creating the object by three points.

Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider.ByManyPoints
Gets the Tekla.BIM.DirectManipulation.Features.CreationCommandParameter for creating the object by n points.

Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider.ByFace
Gets the Tekla.BIM.DirectManipulation.Features.CreationCommandParameter for creating the object by picking a face.

Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider.ByTwoLines
Gets the Tekla.BIM.DirectManipulation.Features.CreationCommandParameter for creating the object by picking two construction lines.

Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider.GetCommandParameter(System.String)
Tries to get the command parameter for the inputType.
inputType: Type of the input.
Returns: The creation command parameter.

Tekla.Structures.DirectManipulation.Model.CreationCommands.InputSpecificProvider.CreateCommandParameter(System.String)
Creates the command parameter for the inputType.
inputType: Type of the input.
Returns: The creation command parameter.